# SetIntermediateColors Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorSettings..::..SetIntermediateColors Method
AnalysisDisplayColorSettings Class See Also
---
Set intermediate color entries (other than the minimum and maximum settings).
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetIntermediateColors(
	IList<AnalysisDisplayColorEntry> map
)
```

Visual Basic
---
```text
Public Sub SetIntermediateColors ( _
	map As IList(Of AnalysisDisplayColorEntry) _
)
```

Visual C++
---
```text
public:
void SetIntermediateColors(
	IList<AnalysisDisplayColorEntry^>^ map
)
```

# ### Parameters
map
    Type: System.Collections.Generic..::..IList<(Of <(<'AnalysisDisplayColorEntry>)>)> Array of intermediate color entries.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | intermediate color entries with specific values are not ordered by value (min to max) or too many intermediate colors (>100). |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace